Revit 2026 API

# WoodWoodRadialNoise Property

---

The property labeled "Radial Noise" from the "Wood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodRadialNoise { get; }
```
```vb
Public Shared ReadOnly Property WoodRadialNoise As String
	Get
```
```cpp
public:
static property String^ WoodRadialNoise {
	String^ get ();
}
```
```fsharp
static member WoodRadialNoise : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 100".

#### Reference

Wood Class

Autodesk.Revit.DB.Visual Namespace